# task 1
'''Поработайте с переменными, создайте несколько, выведите на экран. Запросите у
пользователя некоторые числа и строки и сохраните в переменные, затем выведите на экран.'''
# chis = 55
# chis2 = 55.5
# stroka = 'Строка'
# spisok = []
# print(chis)
# print(spisok)
# print(chis2)
# print(stroka)
# polz_chis = int(input('Введите число '))
# print(f'Ваше число {polz_chis}')


# task 2
'''Пользователь вводит время в секундах. Переведите время в часы, минуты, секунды и
выведите в формате чч:мм:сс. Используйте форматирование строк.'''
# clock = int(input('Введите время в секундах '))
# sekunda = clock % 60
# chas = clock//3600
# minuta = int((clock-chas*3600-sekunda)/60)
# print(f'{chas}:{minuta}:{sekunda}')


# task 3
'''Узнайте у пользователя число n. Найдите сумму чисел n + nn + nnn. Например, пользователь
ввёл число 3. Считаем 3 + 33 + 333 = 369.'''


